/**
 * description: 这个文件是用来存放字典的
 * author: sunkai
 * date: 2018年12月24日
 */
/****************************************************  以下为正文  ************************************************************/
import { generateEnum } from '@/utils/utils';
/**
 * 隐患状态
 */
export const hiddenDangerStatus = generateEnum({
  '1': '新建',
  '2': '待整改',
  '3': '待复查',
  '4': '已关闭',
  '5': '全部',
  '7': '已超期',
});

/**
 * 隐患检查状态，和上面那个基本一样
 */
export const hiddenDangerCheckStatus = generateEnum({
  '2': '未超期',
  '3': '待复查',
  '4': '已关闭',
  '5': '全部',
  '7': '已超期',
});

/**
 * 隐患业务分类
 */
export const hiddenDangerType = generateEnum({
  '1': '安全生产',
  '2': '消防',
  '3': '环保',
  '4': '卫生',
});

/**
 * 隐患上报来源
 */
export const hiddenDangerSource = generateEnum({
  1: '企业自查',
  2: '政府监督',
  3: '维保检查',
});

/**
 * 点位风险等级
 */
export const PointLevel = generateEnum({
  '1': '红',
  '2': '橙',
  '3': '黄',
  '4': '蓝',
  '5': '未评级',
});

/**
 * 点位检查状态
 */
export const pointStatus = generateEnum({
  '1': '正常',
  '2': '异常',
  '3': '待检查',
  '4': '已超时',
});

/**
 * 设备状态
 */
export const deviceStatus = generateEnum({
  '-3': '故障',
  '-1': '失联',
  '0': '正常',
  '1': '预警',
  '2': '告警',
});

/**
 * 单位类型
 */
export const unitType = generateEnum({
  1: '维保',
  2: '政府',
  3: '维保',
  4: '企业',
});

/**
 * websocket类型
 */
export const websocketType = generateEnum({
  1: '【发生监管】',
  2: '【发生联动】',
  3: '【发生反馈】',
  4: '【发生屏蔽】',
  5: '【发生火警】',
  6: '【发生故障】',
  7: '【主机报警】',
  8: '【真实火警处理】',
  9: '【主机报障】',
  10: '【故障上报】',
  11: '【一键报修】',
  12: '【完成故障维修】',
  13: '【安全巡查】',
  14: '【上报隐患】',
  15: '【整改隐患】',
  16: '【重新整改隐患】',
  17: '【复查隐患】',
  18: '【维保巡检】',
  19: '【误报火警处理】',
  20: '【关闭隐患】',
  21: '【复位】',
  22: '【故障恢复】',
  31: '恢复',
  32: '告警',
  33: '企业用电安全状态',
  34: '企业燃气安全状态',
  35: '企业烟感安全状态',
  36: '【水系统报警】',
  37: '【水系统恢复】',
  38: '【独立烟感报警】',
  39: '【可燃气体报警】',
  40: '【独立烟感故障】',
  41: '【脱岗警告】',
  42: '电器火灾失联',
  43: '电器火灾失联恢复',
  44: '电器火灾告警恢复',
  45: '燃气告警恢复',
  46: '独立烟感失联',
  47: '独立烟感失联恢复',
  48: '水系统失联',
  49: '水系统失联恢复',
  50: '独立烟感告警恢复',
  51: '【独立烟感故障恢复】',
});

/*
* 数据处理设备类型
*/
export const dataProcessingType = generateEnum({
  '101': '消防主机',
  '102': '电气火灾监控设备',
  '103': '液位监测设备',
  '104': '液压监测设备',
  '105': '独立烟感',
  '106': '气体报警器',
  '107': 'DCS系统',
  '108': '废气数采仪',
  '109': '废水数采仪',
  '110': 'NVR',
})

/*
* 网关设备类型
*/
export const gatewayDeviceType = generateEnum({
  '201': '用户传输装置',
  '202': 'DTU设备',
  '203': '推流主机',
  '204': 'OPC客户端',
})

/*
* 监测对象类型
*/
export const monitoringObjType = generateEnum({
  '301': '储罐区',
  '302': '储罐',
  '303': '库区',
  '304': '库房',
  '305': '高危工艺',
  '306': '特种设备',
  '307': '消防栓',
  '308': '喷淋系统',
  '309': '消防水箱',
  '310': '消防水池',
  '311': '生产装置',
  '312': '气柜',
  '313': '电源控制柜',
})

/*
* 参数分组类型
*/
export const parameterGroupTypes = generateEnum({
  1: '温度',
  2: '电流',
  3: '电压',
  4: '漏电电流',
  5: '火警',
})

/*
* 机械臂状态
*/
export const armStatusEnum = generateEnum({
  '-20': '关闭',
  '-21': '打开',
  '-22': '未连接',
  '-23': '正在打开',
  '-24': '正在关闭',
  '-25': '故障',
})
